Repository: josephmawa/EncodingExplorer
Catalog: po/*.po
Languages: tr

source: Learn;Character;Number;Text;Binary;Encoding;Encoder;ASCII;UTF-8;UTF-16;UTF-32;
tr: Öğren;Karakter;Sayı;Metin;İkilik;Kodlama;Kodlayıcı;ASCII;UTF-8;UTF-16;UTF-32;

source: Transform characters into binary
tr: Karakterleri ikiliye dönüştür

source: Encoding Explorer is a tool for learning character encoding. Below are the main features.
tr: Encoding Explorer, karakter kodlamasını öğrenmek için bir araçtır. Başlıca özellikleri aşağıdadır.

source: Encode characters to ASCII, UTF-8, UTF-16, and UTF-32.
tr: Karakterleri ASCII, UTF-8, UTF-16 ve UTF-32'ye kodla.

source: Encode numbers to IEEE-754 half, single, and double precision format.
tr: Sayıları IEEE-754 yarım, tek ve çift hassasiyetli formata kodla.

source: Supports real-time encoding.
tr: Gerçek zamanlı kodlamayı destekler.

source: Change the endianness of a multi-byte encoding.
tr: Çok baytlı bir kodlamanın bayt düzenini değiştir.

source: Provides user-friendly interface for exploring encodings.
tr: Kodlamaları keşfetmek için kullanıcı dostu bir arayüz sağlar.

source: Switch to light, dark, or system mode.
tr: Açık, koyu veya sistem moduna geç.

source: Encoding Explorer in dark mode
tr: Koyu modda Encoding Explorer

source: translator-credits
tr: çevirmenler

source: Half Precision
tr: Yarım Hassasiyet

source: Single Precision
tr: Tek Hassasiyet

source: Double Precision
tr: Çift Hassasiyet

source: Binary encoding
tr: İkilik kodlama

source: Sign Bit
tr: İşaret Biti

source: Exponent bits
tr: Üs bitleri

source: Mantissa bits
tr: Mantisa bitleri

source: Actual number
tr: Gerçek sayı

source: Stored number
tr: Depolanan sayı

source: Conversion Error
tr: Dönüştürme Hatası

source: No encoding to copy
tr: Kopyalanacak kodlama yok

source: Copied encoding
tr: Kodlama kopyalandı

source: Truncating text to 2500 characters
tr: Metin 2500 karakterle kısaltılıyor

source: Invalid ASCII
tr: Geçersiz ASCII

source: Lone Surrogate
tr: Yalnız Vekil

# shortcut window
source: General
tr: Genel

# shortcut window
source: Toggle Menu
tr: Menüyü Aç/Kapat

# shortcut window
source: Show Shortcuts
tr: Kısayolları Göster

# shortcut window
source: Quit
tr: Çıkış

# shortcut window
source: Show Preferences
tr: Tercihleri Göster

source: Settings
tr: Ayarlar

source: Endianness
tr: Bayt Düzeni

source: Select byte order
tr: Bayt sırasını seçin

source: Little Endian
tr: Küçük Bayt Dizimi

source: Big Endian
tr: Büyük Bayt Dizimi

source: Radix
tr: Sayı Tabanı

source: Select number base
tr: Sayı tabanını seçin

source: Number base
tr: Sayı tabanı

source: Preferences
tr: Tercihler

source: Color Theme
tr: Renk Teması

source: Set color theme
tr: Renk temasını ayarla

# System color theme
source: System
tr: Sistem

# Light color theme
source: Light
tr: Açık

# Dark color theme
source: Dark
tr: Koyu

source: Mode
tr: Mod

source: Select encoding mode
tr: Kodlama modunu seçin

source: Text Encoding
tr: Metin Kodlaması

source: Main Menu
tr: Ana Menü

source: <b>Text</b>
tr: <b>Metin</b>

# Move to previous character
source: Previous Character
tr: Önceki Karakter

# Move to next character
source: Next character
tr: Sonraki karakter

source: <b>Encoding</b>
tr: <b>Kodlama</b>

source: Switch Encoding
tr: Kodlamayı Değiştir

# accessibility
source: More Settings
tr: Daha Fazla Ayar

# Copy encoded text to clipboard
source: Copy Encoding
tr: Kodlamayı Kopyala

# accessibility
source: Copy Encoding
tr: Kodlamayı Kopyala

source: Toggle Bottom Panel
tr: Alt Paneli Göster/Gizle

# accessibility
source: Toggle Bottom Panel
tr: Alt Paneli Göster/Gizle

source: <b>Number</b>
tr: <b>Sayı</b>

source: <b>IEE-754 Floating Point</b>
tr: <b>IEE-754 Ondalık Sayı</b>

source: Switch floating point format
tr: Ondalık sayı formatını değiştirin

source: Keyboard Shortcuts
tr: Klavye Kısayolları

source: About Encoding Explorer
tr: Encoding Explorer Hakkında
